app/views/employees/_form.html.erb

SELECT "dealerships".* FROM "dealerships"
---
<%= f.label "Select Your Dealership"%><br>
<%= f.collection_select :dealership_id, Dealership.all, :id, :name %><br>