app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def show
        @employee = Employee.find_by(:id => params[:id])

INSERT INTO "employees" ("first_name", "last_name", "dealership_id", "created_at", "updated_at", "manager", "username", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @employee = Employee.new(employee_params)
        if @employee.save

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def edit
        @employee = Employee.find_by(:id => params[:id])