app/controllers/sessions_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."username" = $1 LIMIT $2  [["username", "asdfsadf"], ["LIMIT", 1]]
---
    def create
        user = Employee.find_by(:username => params[:sessions][:username].downcase)