app/controllers/sessions_controller.rb

    def create
      if auth_hash = request.env["omniauth.auth"]
        if @employee = Employee.find_or_create_by_omniauth(auth_hash)
          log_in @employee
          session[:token] = auth_hash["credentials"]["token"]
          redirect_user
        else
          flash.now[:danger] = "Email already exists"
          render :welcome
        end
      else #Normal Login
        @employee = Employee.find_by(:email => params[:sessions][:email].downcase)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."email" = $1 LIMIT $2  [["email", "asdfasdfsad"], ["LIMIT", 1]]